SeanHernan/PebbleOS/src/fw/drivers/nrf5/qspi.c
#include "drivers/qspi.h"

#include "board/board.h"
#include "drivers/dma.h"
#include "drivers/flash/flash_impl.h"
#include "drivers/flash/qspi_flash.h"
#include "drivers/flash/qspi_flash_definitions.h"
#include "drivers/gpio.h"
#include "drivers/periph_config.h"
#include "drivers/qspi_definitions.h"
#include "flash_region/flash_region.h"
#include "kernel/util/delay.h"
#include "kernel/util/sleep.h"
#include "kernel/util/stop.h"
#include "mcu/cache.h"
#include "system/logging.h"
#include "system/passert.h"
#include "util/math.h"

#define NRF5_COMPATIBLE
#include <mcu.h>
#include <nrfx.h>
#include "nrfx/hal/nrf_clock.h"
#include <nrfx_qspi.h>

#include "FreeRTOS.h"
#include "semphr.h"

/* nRF5's QSPI controller is different enough from STM32's that we
 * reimplement qspi_flash.c, not stm32/qspi.c.  */

#define FLASH_RESET_WORD_VALUE (0xffffffff)

static uint8_t s_qspi_ram_buffer[32];

status_t flash_impl_set_nvram_erase_status(bool is_subsector, FlashAddress addr) {
  return S_SUCCESS;
}

status_t flash_impl_clear_nvram_erase_status(void) { return S_SUCCESS; }

status_t flash_impl_get_nvram_erase_status(bool *is_subsector, FlashAddress *addr) {
  // XXX
  return S_FALSE;
}

// only valid option with anomaly 159
#define BASE_CLOCK_DIV NRF_CLOCK_HFCLK_DIV_1
#define BASE_CLOCK_SWITCH_DELAY_US 7

// borrowing from zephyrproject/zephyr/drivers/flash/nrf_qspi_nor.c
// FIXME: tempfix to get working now, should probably review...
// also modified...
static inline void qspi_clock_div_change(nrf_clock_hfclk_div_t *dev)
{
#ifdef MICRO_FAMILY_NRF5340
#if NRF53_ERRATA_159_ENABLE_WORKAROUND
	if (nrf53_errata_159()) {
		/* Save current hfclk configuration */
		*dev = nrf_clock_hfclk_div_get(NRF_CLOCK);
		nrf_clock_hfclk_div_set(NRF_CLOCK, NRF_CLOCK_HFCLK_DIV_2);
	}
#endif
	/* Make sure the base clock divider is changed accordingly
	 * before a QSPI transfer is performed.
	 */
	nrf_clock_hfclk192m_div_set(NRF_CLOCK, BASE_CLOCK_DIV);
	delay_us(BASE_CLOCK_SWITCH_DELAY_US); // wait 7 us
#endif
}

// borrowing from zephyrproject/zephyr/drivers/flash/nrf_qspi_nor.c
// FIXME: tempfix to get working now, should probably review...
// also modified...
static inline void qspi_clock_div_restore(nrf_clock_hfclk_div_t *dev)
{
#ifdef MICRO_FAMILY_NRF5340
	/* Restore the default base clock divider to reduce power
	 * consumption when the QSPI peripheral is idle.
	 */
	nrf_clock_hfclk192m_div_set(NRF_CLOCK, NRF_CLOCK_HFCLK_DIV_4);
#if NRF53_ERRATA_159_ENABLE_WORKAROUND
	if (nrf53_errata_159()) {
		/* Restore previous hfclk configuration */
		nrf_clock_hfclk_div_set(NRF_CLOCK, *dev);
	}
#endif
#endif
}

#if defined(MICRO_FAMILY_NRF5340)
  #define ERRATA_159_WRAPPER(func) \
    nrf_clock_hfclk_div_t clock_state = 0; \
    qspi_clock_div_change(&clock_state); \
    func \
    qspi_clock_div_restore(&clock_state);
#else
  #define ERRATA_159_WRAPPER(func) \
    func
#endif



// nrfx_err_t nrfx_qspi_cinstr_xfer_MODIFIED(nrf_qspi_cinstr_conf_t const * p_config, void const * p_tx_buffer, void * p_rx_buffer) {
//   // adding bit to account for errata 159 since this is an old sdk and I don't 
//   // want to go though the pain of fully updating it atm

// #if defined(MICRO_FAMILY_NRF5340)
//   nrf_clock_hfclk_div_t clock_state = 0;
//   qspi_clock_div_change(&clock_state);
// #endif

//   nrfx_err_t err = nrfx_qspi_cinstr_xfer(p_config, p_tx_buffer, p_rx_buffer);

// #if defined(MICRO_FAMILY_NRF5340)
//   qspi_clock_div_restore(&clock_state);
// #endif

//   return err;
// }

// nrfx_err_t nrfx_qspi_read_MODIFIED(void * p_rx_buffer, size_t rx_buffer_length, uint32_t src_address) {
//   // adding bit to account for errata 159 since this is an old sdk and I don't 
//   // want to go though the pain of fully updating it atm

// #if defined(MICRO_FAMILY_NRF5340)
//   nrf_clock_hfclk_div_t clock_state = 0;
//   qspi_clock_div_change(&clock_state);
// #endif

//   nrfx_err_t err = nrfx_qspi_read(p_rx_buffer, rx_buffer_length, src_address);

// #if defined(MICRO_FAMILY_NRF5340)
//   qspi_clock_div_restore(&clock_state);
// #endif

//   return err;
// }

// nrfx_err_t nrfx_qspi_write_MODIFIED(void const * p_tx_buffer, size_t tx_buffer_length, uint32_t dst_address) {
//   // adding bit to account for errata 159 since this is an old sdk and I don't 
//   // want to go though the pain of fully updating it atm

// #if defined(MICRO_FAMILY_NRF5340)
//   nrf_clock_hfclk_div_t clock_state = 0;
//   qspi_clock_div_change(&clock_state);
// #endif

//   nrfx_err_t err = nrfx_qspi_write(p_tx_buffer, tx_buffer_length, dst_address);

// #if defined(MICRO_FAMILY_NRF5340)
//   qspi_clock_div_restore(&clock_state);
// #endif

//   return err;
// }

// not using wrapper because its used in annoying spots like while loops, simple macro doesn't work :(
nrfx_err_t nrfx_qspi_mem_busy_check_MODIFIED() {
  // adding bit to account for errata 159 since this is an old sdk and I don't 
  // want to go though the pain of fully updating it atm

#if defined(MICRO_FAMILY_NRF5340)
  nrf_clock_hfclk_div_t clock_state = 0;
  qspi_clock_div_change(&clock_state);
#endif

  nrfx_err_t err = nrfx_qspi_mem_busy_check();

#if defined(MICRO_FAMILY_NRF5340)
  qspi_clock_div_restore(&clock_state);
#endif

  return err;
}

static void prv_read_register(QSPIPort *dev, uint8_t instruction, uint8_t *data, uint32_t length) {
  nrf_qspi_cinstr_conf_t instr = NRFX_QSPI_DEFAULT_CINSTR(instruction, length + 1);
  instr.io2_level = true;
  instr.io3_level = true;
  ERRATA_159_WRAPPER(nrfx_err_t err = nrfx_qspi_cinstr_xfer(&instr, NULL, data);)
  PBL_ASSERTN(err == NRFX_SUCCESS);
}

static void prv_write_register(QSPIPort *dev, uint8_t instruction, const uint8_t *data,
                               uint32_t length) {
  nrf_qspi_cinstr_conf_t instr = NRFX_QSPI_DEFAULT_CINSTR(instruction, length + 1);
  instr.io2_level = true;
  instr.io3_level = true;
  instr.wren = true;
  ERRATA_159_WRAPPER(nrfx_err_t err = nrfx_qspi_cinstr_xfer(&instr, data, NULL);)
  PBL_ASSERTN(err == NRFX_SUCCESS);
}

static void prv_write_cmd_no_addr(QSPIPort *dev, uint8_t cmd) {
  nrf_qspi_cinstr_conf_t instr = NRFX_QSPI_DEFAULT_CINSTR(cmd, 1);
  instr.io2_level = true;
  instr.io3_level = true;
  ERRATA_159_WRAPPER(nrfx_err_t err = nrfx_qspi_cinstr_xfer(&instr, NULL, NULL);)
  PBL_ASSERTN(err == NRFX_SUCCESS);
}

static bool prv_poll_bit(QSPIPort *dev, uint8_t instruction, uint8_t bit_mask, bool should_be_set,
                         uint32_t timeout_us) {
  uint32_t loops = 0;
  uint8_t val;
  while (1) {
    prv_read_register(dev, instruction, &val, 1);
    if ((!!(val & bit_mask)) == should_be_set) break;
    if ((timeout_us != QSPI_NO_TIMEOUT) && (++loops > timeout_us)) {
      PBL_LOG(LOG_LEVEL_ERROR, "Timeout waiting for a bit!?!?");
      return false;
    }
    delay_us(1);
  }

