SeanHernan/PebbleOS/src/fw/drivers/nrf5/qspi.c
  instr.io2_level = true;
  instr.io3_level = true;

  if (dev->state->part->size > 0x1000000) {
    instr.length = 7;
    out[0] = (addr >> 24U);
    out[1] = (addr >> 16U) & 0xFFU;
    out[2] = (addr >> 8U) & 0xFFU;
    out[3] = addr & 0xFFU;
  } else {
    instr.length = 6;
    out[0] = (addr >> 16U) & 0xFFU;
    out[1] = (addr >> 8U) & 0xFFU;
    out[2] = addr & 0xFFU;
  }

  ERRATA_159_WRAPPER(err = nrfx_qspi_cinstr_xfer(&instr, out, in);)
  if (err != NRFX_SUCCESS) {
    return E_ERROR;
  }

  if (dev->state->part->size > 0x1000000) {
    *val = in[5];
  } else {
    *val = in[4];
  }

  return 0;
}

status_t qspi_flash_security_registers_are_locked(QSPIFlash *dev, bool *locked) {
  uint8_t sr2;

  prv_read_register(dev->qspi, dev->state->part->instructions.rdsr2, &sr2, 1);

  *locked = !!(sr2 & dev->state->part->flag_status_bit_masks.sec_lock);

  return 0;
}

status_t qspi_flash_erase_security_register(QSPIFlash *dev, uint32_t addr) {
  status_t ret;
  nrfx_err_t err;
  nrf_qspi_cinstr_conf_t instr = NRFX_QSPI_DEFAULT_CINSTR(dev->state->part->instructions.erase_sec, 0);
  uint8_t out[4];

  ret = prv_qspi_security_register_check(dev, addr);
  if (ret != S_SUCCESS) {
    return ret;
  }

  instr.io2_level = true;
  instr.io3_level = true;
  instr.wren = true;

  if (dev->state->part->size > 0x1000000) {
    instr.length = 5;
    out[0] = (addr >> 24U);
    out[1] = (addr >> 16U) & 0xFFU;
    out[2] = (addr >> 8U) & 0xFFU;
    out[3] = addr & 0xFFU;
  } else {
    instr.length = 4;
    out[0] = (addr >> 16U) & 0xFFU;
    out[1] = (addr >> 8U) & 0xFFU;
    out[2] = addr & 0xFFU;
  }

  ERRATA_159_WRAPPER(err = nrfx_qspi_cinstr_xfer(&instr, out, NULL);)
  if (err != NRFX_SUCCESS) {
    return E_ERROR;
  }

  while (nrfx_qspi_mem_busy_check_MODIFIED() == NRFX_ERROR_BUSY) {
  }

  return 0;
}

status_t qspi_flash_write_security_register(QSPIFlash *dev, uint32_t addr, uint8_t val) {
  status_t ret;
  nrfx_err_t err;
  nrf_qspi_cinstr_conf_t instr = NRFX_QSPI_DEFAULT_CINSTR(dev->state->part->instructions.program_sec, 0);
  uint8_t out[5];

  ret = prv_qspi_security_register_check(dev, addr);
  if (ret != S_SUCCESS) {
    return ret;
  }

  instr.io2_level = true;
  instr.io3_level = true;
  instr.wren = true;

  if (dev->state->part->size > 0x1000000) {
    instr.length = 6;
    out[0] = (addr >> 24U);
    out[1] = (addr >> 16U) & 0xFFU;
    out[2] = (addr >> 8U) & 0xFFU;
    out[3] = addr & 0xFFU;
    out[4] = val;
  } else {
    instr.length = 5;
    out[0] = (addr >> 16U) & 0xFFU;
    out[1] = (addr >> 8U) & 0xFFU;
    out[2] = addr & 0xFFU;
    out[3] = val;
  }

  ERRATA_159_WRAPPER(err = nrfx_qspi_cinstr_xfer(&instr, out, NULL);)
  if (err != NRFX_SUCCESS) {
    return E_ERROR;
  }

  while (nrfx_qspi_mem_busy_check_MODIFIED() == NRFX_ERROR_BUSY) {
  }

  return 0;
}

const FlashSecurityRegisters *qspi_flash_security_registers_info(QSPIFlash *dev) {
  return &dev->state->part->sec_registers;
}

#ifdef RECOVERY_FW
status_t qspi_flash_lock_security_registers(QSPIFlash *dev) {
  uint8_t sr[2];

  prv_read_register(dev->qspi, dev->state->part->instructions.rdsr1, &sr[0], 1);
  prv_read_register(dev->qspi, dev->state->part->instructions.rdsr2, &sr[1], 1);

  sr[1] |= dev->state->part->flag_status_bit_masks.sec_lock;

  prv_write_register(dev->qspi, dev->state->part->instructions.wrsr, sr, 2);

  return 0;
}
#endif // RECOVERY_FW

#if !RELEASE
#include "console/prompt.h"
#include "drivers/flash.h"
#include "kernel/pbl_malloc.h"
#include "system/profiler.h"
#include "util/size.h"

static bool prv_flash_read_verify(QSPIFlash *dev, int size, int offset) {
  bool success = true;

  profiler_start();
  // prv_read_mmap(dev, 0, buffer_mmap, size);
  profiler_stop();
  uint32_t mmap_time = profiler_get_total_duration(true);

  const int buf_size = 64;
  char buf[buf_size];
  prompt_send_response_fmt(buf, buf_size, "Size: %d UNIMPL: MMP: %" PRIu32, size, mmap_time);

  return success;
}

struct FlashReadTestValues {
  int size;
  int offset;
};

const struct FlashReadTestValues FLASH_READ_TEST_TABLE[] = {
    {.size = 1024, .offset = 0}, {.size = 1025, .offset = 0}, {.size = 1026, .offset = 0},
    {.size = 1027, .offset = 0}, {.size = 1024, .offset = 1}, {.size = 1025, .offset = 2},
    {.size = 1026, .offset = 3}, {.size = 4, .offset = 0},    {.size = 20, .offset = 0},
    {.size = 60, .offset = 0},   {.size = 127, .offset = 0},  {.size = 128, .offset = 0},
};

void command_flash_apicheck(const char *len_str) {
  QSPIFlash *dev = QSPI_FLASH;
  const int buf_size = 64;
  char buf[buf_size];
  int failures = 0;
  int passes = 0;

  profiler_init();

  prompt_send_response("Check whoami");
  if (!qspi_flash_check_whoami(dev)) {
    ++failures;
    prompt_send_response("ERROR: Who am I failed");
  } else {
    ++passes;
  }

  prompt_send_response("Enter low power mode");
  flash_impl_enter_low_power_mode();

  // WHOAMI should fail in low-power mode
  prompt_send_response("Check whoami, should fail in low power mode");
  if (qspi_flash_check_whoami(dev)) {
    ++failures;
    prompt_send_response("ERROR: Who am I failed");
  } else {
    ++passes;
  }

  prompt_send_response("Exit low power mode");
  flash_impl_exit_low_power_mode();

  prompt_send_response("Start flash_read_verify test");

  const int final_size = atoi(len_str);

  // If size is 0 run through a pre-defined table
  if (final_size == 0) {
    for (unsigned int i = 0; i < ARRAY_LENGTH(FLASH_READ_TEST_TABLE); ++i) {
      bool result = prv_flash_read_verify(dev, FLASH_READ_TEST_TABLE[i].size,
                                          FLASH_READ_TEST_TABLE[i].offset);
      if (!result) {
        ++failures;
      } else {
        ++passes;
      }
    }

  } else {
    if (prv_flash_read_verify(dev, final_size, 3)) {
      ++passes;
    } else {
      ++failures;
      prompt_send_response("ERROR: flash_read_verify failed");
    }
  }

  bool was_busy = false;

  // write a few bytes to the sector we're going to erase so it's not empty
  uint8_t dummy_data = 0x55;
  flash_write_bytes(&dummy_data, FLASH_REGION_FIRMWARE_DEST_BEGIN, sizeof(dummy_data));
  profiler_start();
  status_t result = flash_impl_erase_sector_begin(FLASH_REGION_FIRMWARE_DEST_BEGIN);
  flash_impl_get_erase_status();
  if (result == S_SUCCESS) {
    while (flash_impl_get_erase_status() == E_BUSY) {
      was_busy = true;
    }
  }
  profiler_stop();
  uint32_t duration = profiler_get_total_duration(true);
  prompt_send_response_fmt(buf, buf_size, "Erase took: %" PRIu32, duration);

